Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་གང་གི་ཚེ་བཙས་ནས། ལོ་བདུན་ལོན་པ་དེའི་ཚེ། དེས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་དེས་ཕ་མ་ལ་གསོལ་ཏེ།
en: Seven years after her birth, she found faith in the doctrine of the Blessed One, asked for her parents’ permission,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས། རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བར་གྱུར་ཏོ། །
en: went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship, becoming a person of great miracles and great power.

source: དེ་ནས་དེ་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས་བསམས་པ་བདག་གང་ནས་ཤི་འཕོས་ཏེ།
en: After she had achieved arhatship she asked herself, “Whence did I die, that I have taken rebirth here?”

source: འདིར་སྐྱེས་སྙམ་པ་དང་དེས་མཉན་དུ་ཡོད་པ་དེ་ཉིད་དུ་རིགས་ངན་གྱི་བུ་མོ་མི་སྡུག་པའི་སྣ་གྲངས་བཅྭ་བརྒྱད་དང་ལྡན་པར་གྱུར་པ་ལས།
en: She saw that she had previously taken rebirth there in Śrāvastī as a girl of lower caste who was ugly in eighteen different ways and that, with

source: དེར་བདག་གིས་འཕགས་པ་ཀུན་དགའ་བོ་ལ་བརྟེན་ནས་རིགས་ངན་གྱི་སྐྱེ་གནས་སྤངས་ཏེ
en: the help of Noble Ānanda, she had given up her births as a woman of lower caste.

source: དེར་སྐྱེས་པ་མཐོང་ནས་དེའི་བློ་སྐྱེས་པ་འཕགས་པ་ཀུན་དགའ་བོ་ནི་བདག་ལ་དཀའ་བ་བྱེད་བྱེད་པ་ཡིན་ནོ་སྙམ་དུ་རིག་ནས།
en: When she saw all this, she thought, “Look at the difficult task Venerable Ānanda has done for me!”

source: དེར་རྟག་ཏུ་འགྲོ་ཞིང་བཀུར་སྟི་བྱེད་དོ། །
en: And keeping this in mind, she continually went to venerate him.

source: དེ་ནས་དགེ་སློང་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: The monks asked the Blessed Buddha,

source: བཙུན་པ་གསེར་མདོག་གིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ།
en: “Lord, what action did Golden Color take that ripened into her birth into a family of great means, prosperity, and wealth, and

source: གསེར་གྱི་མདོག་ཅན་དུ་གྱུར་ལ། བཅོམ་ལྡན་འདས་ཀྱང་འདིས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: with a golden complexion, and that she pleased and did not displease the Blessed One, went forth in the Blessed One’s doctrine, cast away all her afflictive emotions, and manifested arhatship?”

source: དགེ་སློང་དག་མཉན་དུ་ཡོད་པ་འདི་ཉིད་ནས་ས་ཕྱོགས་ག་གེ་མོ་ཞིག་ན། རིགས་ངན་གྱི་བུ་མོ་མི་སྡུག་པའི་སྣ་གྲངས་བཅྭ་བརྒྱད་དང་ལྡན་པ་ཞིག་འདུག་པ་ཁྱོད་ཀྱིས་མཐོང་ངམ།
en: “Did you see, right here in Śrāvastī there was a young woman of lower caste, who was ugly in eighteen different ways?”

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Yes, Blessed One, we saw her.”

source: དེ་དེ་ནས་ཤི་འཕོས་ནས་འདིར་སྐྱེས་ཏེ།
en: “After she died, she transmigrated and took rebirth here.

source: དེས་དབུ་སྐྲ་དང་སེན་མོའི་མཆོད་རྟེན་ལ་ཏིལ་མར་གྱི་བྱུག་པ་དང་། སྦྱར་བའི་སྤོས་ཀྱི་བྱུག་པ་དང་། གུར་གུམ་གྱི་བྱུག་པ་དང་། སྤོས་ཀྱི་བྱུག་པ་ཕུལ་ནས་
en: She made offerings of sesame oil ointment, blended incense ointment, saffron ointment, and other incense ointments to a reliquary stūpa.

source: ང་ལ་གོས་ཕུལ་ཏེ་ང་ལ་སེམས་དགའ་བ་བསྐྱེད་ནས་ ཤི་བའི་འོག་ཏུ་ལས་དེའི་རྣམ་པར་སྨིན་པས། འདི་ད་ལྟར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེགཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་གསེར་གྱི་མདོག་ཅན་དུ་གྱུར་ཏོ། །
en: Then she offered me clothing and passed away, filled with joy toward me. Those acts ripened into her birth into a family of great means, prosperity, and wealth, and such that she is now well proportioned, pleasing to the eye, beautiful, and has a golden complexion.”

source: བཙུན་པ་བུ་མོ་འདིས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས། རིགས་ངན་གྱི་རིགས་སུ་སྐྱེས་ཏེ། མི་སྡུག་པའི་སྣ་གྲངས་བཅྭ་བརྒྱད་དང་ལྡན་པར་གྱུར་ལགས།
en: “Lord, what action did this young woman take that ripened into her birth into a family of lower caste, and that she was ugly in eighteen different ways?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ཉིད་ཀྱིས་ལས་རྣམས་བྱས་ཤིང་བསགས་ཏེ་
en: “Monks,” the Blessed One explained, “such are the actions that she committed and accumulated:

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past in this fortunate eon, when people lived as long as twenty thousand years and the totally and completely awakened buddha, the one endowed with perfect knowledge and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, there lived a certain householder in Vārāṇasī.

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས། དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་ཕྱི་ཞིག་ན།
en: “When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུ་འམ་བཅུ་ལོན་པ་དང་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས་
en: One day his wife conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ། རིགས་དང་འཐུན་པའི་མིང་བཏགས་ནས་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: At the elaborate feast celebrating her birth they named her according to their clan.

source: དེ་གང་གི་ཚེ་ཆེན་མོར་གྱུར་པ་དེའི་ཚེ། དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས།
en: They reared her on milk, yogurt, butter, ghee, and milk solids, and when she grew up, she found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: དེས་ཕ་མ་ལ་གསོལ་ཏེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། དེ་འཐབ་ཀྲོལ་ཅན་ཁ་ཚས་ངན་པར་གྱུར་ཏོ། །
en: “She asked for her parents’ permission and went forth in the doctrine of the totally and completely awakened Buddha, but soon she became quarrelsome and abusive.

source: དེས་བྱད་གཟུགས་དང་ལང་ཚོ་དང་དབང་ཕྱུག་དང་ཆོ་རིགས་ཀྱི་རྒྱགས་པས་དྲེགས་ནས་སློབ་པ་དང་མི་སློབ་པའི་དགེ་སློང་མ་མང་པོ་ཞིག་ལ་བྱད་གཟུགས་མི་སྡུག་པའི་ལུས་དང་ངག་གི་ལས་རྣམས་ཀྱིས་དཔྱས་ཏེ།
en: Arrogant about her well-proportioned body, youthfulness, and high caste, she spoke harshly to many nuns on the paths of learning and no more to learn, ridiculing their bodies as ugly and even

source: རིགས་ངན་ཞེས་བྱ་བའི་ཚིག་ཀྱང་སྨྲས་པ་ལས། ཕྱིས་དེ་འགྱོད་པ་སྐྱེས་སོ། །
en: calling them low class. In time she came to regret this.

source: དེ་ནས་དེས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། སྨོན་ལམ་བཏབ་པ།
en: “Then after practicing pure conduct all her life, she prayed,

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་དག་སྤྱད་ཀྱང་། ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: ‘While I may not have attained any great virtues, still I have gone forth in the doctrine of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life.

source: བདག་གིས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་དེ་དག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་སྡིག་པའི་ལས་དེའི་འབྲས་བུ་བདག་ལ་སྨིན་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May I not meet with the results of the wrongful act of speaking harshly to fellow practitioners of the holy life.’

source: དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་མར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། མི་སྡུག་པ་འདི་ཉིད་ཡིན་ཏེ
en: The one who went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa and became a nun then is none other than the ugly girl.

source: དེས་དེར་བྱད་གཟུགས་དང་ལང་ཚོ་དང་དབང་ཕྱུག་དང་ཆོ་རིགས་ཀྱི་རྒྱགས་པས་དྲེགས་ནས་དགེ་སློང་མ་མང་པོ་ཞིག་ལ་མི་སྡུག་པའི་ཚུལ་གྱིས། ལུས་ཀྱི་ལས་ཀྱིས་འཕྱས་པ་དང་། རིགས་ངན་ཞེས་བྱ་བའི་ཚིག་བརྗོད་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་རིགས་ངན་གྱི་རིགས་སུ་སྐྱེས་ཏེ
en: At that time, out of arrogance about her well-proportioned body, youthfulness, and high caste, she spoke harshly to many nuns, slandering them terribly by calling them ugly and saying they were low class. Those acts ripened such that wherever she was born,

source: མི་སྡུག་པའི་སྣ་གྲངས་བཅྭ་བརྒྱད་དང་ཡང་ལྡན་པར་གྱུར་ཏོ། །
en: it was as a person of lower caste who was ugly in eighteen different ways.

source: དེ་ནས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: “Then she practiced pure conduct all her life, and at the time of her death, she prayed,

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.’

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: that she has pleased and not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: བ་ལང་རྫི་ཞེས་བྱ་བ་ནི།
en: The Cowherds

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཟླ་བ་གསུམ་དུ་སྤྱན་དྲངས་ཏེ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས་
en: One time when the Blessed One was in Śrāvastī, King Prasenajit hosted the Buddha and the rest of the saṅgha of monks for three months in the garden of Prince Jeta and provided for all their needs.

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་གྱི་འདབ་ཏུ་བ་ལང་དང་མ་ཧེའི་ལྷས་བཅས་ཏེདགེ་སློང་རྣམས་པའི་དར་བ་དང་མ་ཧེའི་དར་བས་ལོངས་སྤྱོད་པར་བྱེད་དོ། །
en: The garden of Prince Jeta was close to where the cows and water buffalo were penned, so all the monks enjoyed the cow and buffalo buttermilk.

source: དེས་ཟླ་བ་གསུམ་གྱི་བར་དུ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས།
en: At the end of three months of respectfully providing for all the needs of the Buddha and the rest of the saṅgha of monks,

source: མཇུག་ཏུ་སངས་རྒྱས་ལ་སོགས་པའི་དགེ་སློང་གི་དགེ་འདུན་ལ་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འབུམ་རི་བའི་ན་བཟའ་ཕུལ་ལོ། །
en: King Prasenajit offered to the saṅgha foods of a hundred flavors and to the Blessed One very costly robes.

source: དགེ་སློང་གཞན་དག་ལ་ཡང་རེ་རེ་ལ་ཡོ་བྱད་ཐམས་ཅད་ཕུལ་ཏེ། བ་ལང་རྫི་དང་མ་ཧེ་རྫི་ཐམས་ཅད་རང་རང་གི་གནས་སུ་སོ་སོར་བཀྱེ་ནས་རྒྱལ་པོ་སོང་ངོ་། །
en: After he had provided each of the monks with everything they needed, the king discharged the cow herders and buffalo herders back to their homes and departed.

source: དེ་ནས་བ་ལང་རྫི་རྣམས་ཀྱིས་བསམས་པ།
en: The cowherds thought,

source: རྒྱལ་པོ་འདི་སའི་མངའ་བདག་དབང་ཕྱུག་གི་མཐར་ཕྱིན་པ་ཡིན་མོད་ཀྱི་འདི་ཡང་ད་དུང་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་ལ།
en: “This king is a true sovereign and a consummate ruler. While he goes on giving gifts and making merit,

source: བདག་ཅག་ནི་གཞན་གྱི་ཁོལ་པོ་གཞན་གྱི་ངོར་བལྟ་བ་གཞན་གྱི་ཚལ་ཟ་བྱེད་ཅིང་འཚོ་བ་ཡིན་ཏེ
en: we are but the servants of others, deferential toward them, and subsist by eating their food.

source: འདིས་འདི་ལྟ་བུའི་གནས་ཐོབ་པ་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་སྦྱིན་པ་དང་དུལ་བ་དང་ཡང་དག་པར་སྡོམ་པའི་ལས་རྣམ་པ་གསུམ་གྱི་འབྲས་བུ་ཡིན་གྱིས།
en: Their achievement of such a state is entirely the result of these three things: generosity, self-control, and self-restraint.

source: མ་ལ་བདག་ཅག་གིས་ཀྱང་དགེ་བའི་ཆོས་ཅུང་ཟད་ཙམ་ཡང་དག་པར་བླངས་ཏེ་གནས་པར་བྱ་གོར་མ་ཆག་སྙམ་དུ་བསམས་ནས
en: Oh, but doubtless then we should adopt and adhere to a bit of virtuous Dharma!”

source: བ་ལང་རྫི་ལྔ་བརྒྱས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་ཏེ།
en: The five hundred cowherds resolved to extend an invitation to the Buddha and the rest of the saṅgha of monks.

source: བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་བཤམས་ནས་ནང་པར་སྔར་ལངས་ཏེ་ཆུ་ར་བཀང་ནས་
en: They prepared many good, wholesome foods and in the morning they rose, filled the water pots, and

source: བཅོམ་ལྡན་འདས་ལ་ཕྲིན་གྱིས་གདུགས་ཚོད་བསྐུལ་བ་བཙུན་པ་གདུགས་ཚོད་ལ་བབ་སྟེ་
en: sent a message to the Blessed One reminding him it was time for the midday meal:

source: བཤོས་གསོལ་ལགས་ན།
en: “Lord, the midday meal is upon us.

source: ལྷུང་བཟེད་བསྣམས་ནས། དགེ་སློང་གི་ཚོགས་ཀྱིས་ཞབས་འབྲིང་བྱས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས།
en: carrying his alms bowl, he set out surrounded and attended by an assembly of monks.

source: བ་ལང་རྫི་དེ་དག་གི་བ་ལང་གི་ལྷས་དང་སྐོས་སའི་འདབ་ཏུ་གཤེགས་ཏེ་བྱོན་ནས་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: They arrived at the appointed place near the cowherds’ pens and took a seat.

source: དེ་ནས་བ་ལང་རྫི་དེ་དག་གིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་བདེ་བར་བཞུགས་པར་རིག་ནས། རིང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་དང་། བའི་དར་བ་དང་མ་ཧེའི་དར་བས་ཚིམ་པར་བྱས་ཏེ་
en: Once the cowherds knew that the Buddha and the rest of the saṅgha of monks were comfortably seated, by their own hands they contented them with many good, wholesome foods and with buttermilk from the cows and buffalo, proffering all that they wished.

source: ཅི་བཞེད་པ་བསྟབས་ནས་བཤོས་གསོལ་ཟིན་ཏེ་གསང་སྡེར་ནི་གྱུ། ཕྱག་ནི་བཅབས་པར་རིག་ནས་སྟན་ཆེས་དམའ་བ་དག་ཁྱེར་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: When they knew that they had finished eating and that their bowls had been taken away and their hands washed, the cowherds brought in very low seats and sat before the Blessed One to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བ་ལང་རྫི་ལྔ་བརྒྱ་པོ་དེ་དག་གི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་དང་ཤེས་པ་ཐུགས་སུ་ཆུད་ནས། དེ་དང་མཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended the thoughts, habitual tendencies, temperament, capacity, and nature of all five hundred of the cowherds, and taught them the Dharma accordingly.

source: དེས་བ་ལང་རྫི་ལྔ་བརྒྱ་པོ་དེ་དག་འཁོར་དང་བཅས་པས་སྟན་དེ་ཁོ་ན་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནསརྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When they heard it, the five hundred cowherds and their families destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེ་དག་གིས་ཀྱང་བདེན་པ་མཐོང་ནས་གསོལ་པ།
en: They saw the truths and implored the Blessed One,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཁྱིམ་ན་གནས་པ་ལས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ལ། ཆུ་བོ་རྣམས་ལས་བརྒལ་བར་བགྱི་བ་དང་། སྦྱོར་བ་རྣམས་ལས་ཡང་དག་པར་འདའ་བར་བགྱི་བའི་སླད་དུ་བརྩོན་པར་བགྱི་བསྒྲུབ་པར་བགྱི་འབད་པར་བགྱི་བར་འཚལ་ལོ་ཞེས་གསོལ་ནས
en: “Blessed One, let us give up living at home to go forth in the doctrine of the Blessed One, in order to ford the floodwaters and completely escape our fetters with diligence, practice, and effort.”

source: རྒྱལ་པོ་གསལ་རྒྱལ་ལ་གསོལ་ཏེ། བ་ལང་གི་ཁྱུ་དེ་རྣམས་བ་ལང་རྫི་གཞན་དག་ལ་གཏད་ནས་ཁྱིམ་གྱི་འཁོར་བཏང་སྟེ།
en: They appealed to King Prasenajit, handed their herds of cattle over to other cowherds, and bid farewell to everyone at home.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་དོང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then they approached the Blessed One, touched their heads to his feet, and made this request:

source: དེ་ནས་དེ་དག་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བཀའ་སྩལ་ཏེ། དགེ་སློང་དག་ཚུར་ཤོག་ཚངས་པར་སྤྱོད་ཅིག་ཅེས་བཀའ་སྩལ་ནས། དེ་ཐོས་མ་ཐག་ཏུ་སྐྲ་ནི་བྱི་བར་གྱུར་ལུས་ལ་ནི་སྣམ་སྦྱར་གྱོན་པར་གྱུར་ཏེ། སྐྲ་དང་ཁ་སྤུ་ནི་བྲེགས་ནས་ཞག་བདུན་ལོན་པ་ཙམ་དུ་གྱུར་སྤྱོད་ལམ་ནི་བསྙེན་པར་རྫོགས་ནས་ལོ་བརྒྱ་ལོན་པ་ལྟ་བུར་འདུག་པར་གྱུར། ལག་ན་ནི་ལྷུང་བཟེད་དང་ཆུ་སྣོད་ཐོགས་པར་གྱུར་ཏོ། །
en: The Blessed One replied, “Come, join me, monks!” As soon as the Blessed One had finished speaking there they stood, alms bowl and water pitcher in hand, with but a week’s worth of hair and beard, and with the deportment of a monk who had been ordained for one hundred years.

source: དེ་བཞིན་གཤེགས་པས་ཚུར་ཞེས་བཀའ་སྩལ་པ། དེ་དག་མགོ་བྲེགས་ལུས་ལ་སྣམ་སྦྱར་གྱོན། །སངས་རྒྱས་ཀྱིས་ནི་དགོངས་པས་གོས་བགོས་ནས། །མོད་ལ་དབང་པོ་རབ་ཏུ་ཞི་བར་གནས། །
en: Garbed in robes, with shaven heads, And senses stilled by Buddha’s will— From the very moment the One Thus Gone Spoke to them, saying, “Come, join me.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་ལུང་ཕོག་ནས། དེ་དག་གིས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས།
en: The Blessed One conferred on them instruction, and, casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དེ་དག་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ཏེ། གསེར་དང་བོང་བར་མཉམ་པ་ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ་ཙན་དན་སྦངས་པ་ལྟ་བུར་བསིལ་བར་གྱུར་པ།
en: As arhats, free from the attachments of the three realms, their minds regarded gold no differently than filth, and the palms of their hands as like space itself. They became cool like wet sandalwood.

source: དེ་དག་གིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས་བསམས་པ།
en: After attaining arhatship they wondered,

source: བདག་ཅག་གིས་འདུལ་བར་འགྱུར་བ་འགའ་ལྟ་ཡོད་དམ་སྙམ་པ་དང་དེ་དག་གིས་ཉེ་དུ་དེ་དག་ཉིད་འདུལ་བར་འགྱུར་བར་མཐོང་ངོ་། །
en: “Whom might we tame?” They saw they could tame their relatives, and, recognizing this, they went to their relatives and taught them the Dharma.

source: མཐོང་ནས་ཀྱང་དེ་དག་གི་ཐད་དུ་དོང་སྟེ་ཆོས་བསྟན་ནས་དད་པ་ཕུན་སུམ་ཚོགས་པ་ལ་ནི་བཀོད། སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་ལ་ནི་བཙུད་སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའ་བྱ་བ་ལ་ནི་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ། །
en: They led them to live lives of perfect faith, to go for refuge, to maintain the fundamental precepts, and inspired them to give gifts and share what they had.

source: དེ་དག་གི་ནང་ནས་བ་ལང་རྫི་མོ་གཅིག་ནི་མ་དད་དེ།
en: There was one cowherd among their relatives who did not have faith.

source: བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོར་མི་བཏུབ་ནས་བ་ལང་རྫི་དེ་དག་གིས་དེ་ནན་གྱིས་བཟུང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཁྲིད་ནས།
en: Since she had not been able to go and see the Blessed One the other cowherds took her and brought her to the Blessed One.

source: བ་ལང་རྫི་མོ་དེས་ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ།
en: The cowherd saw the Blessed Buddha from a distance.

source: མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ་མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ།
en: His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire, like flames stoked with ghee,

source: མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ་མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ།
en: like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels.

source: བློ་གསལ་ཞིང་དྲི་མ་མེད་ལ་རྣམ་པར་དག་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: He was immaculate, clear-minded, and pure of heart.

source: དེ་ལྟར་མཐོང་ནས་ཀྱང་དགའ་བ་སྐྱེས་ཏེ་ཕན་ཚུན་དུ་བལྟས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་ན།
en: Experiencing such delight at the sight of the Blessed One, she looked around wondering,

source: བདག་གིས་མེ་ཏོག་ག་ལས་བླང་བ་སྙམ་པ་དང་
en: “Where can I get flowers to offer to the Blessed One?”

source: དེས་ཐག་མི་རིང་བ་ཞིག་ན་ཀོ་ཤ་ཏ་ཀའི་མེ་ཏོག་དག་ཅིག་མཐོང་ནས་དེས་དེ་དག་བླངས་ཏེ།
en: Then she spotted some kośataka flowers not far in the distance.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་ནས་བཅོམ་ལྡན་འདས་ལ་ཀོ་ཤ་ཏ་ཀའི་མེ་ཏོག་གིས་གཏོར་ཏེ།
en: After gathering them up, she went to the Blessed One and scattered the kośataka flowers over him.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: She then touched her head to the Blessed One’s feet and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་ན།
en: The Blessed One thought,

source: བུ་མོ་འདི་ནི་ཚེ་ཐུང་སྟེ་རིང་པོ་མི་ཐོགས་པར་འཆི་བར་འགྱུར་རོ་
en: “This young woman’s life will be very short. It is not long before she will die.”

source: སྙམ་དུ་ཐུགས་སུ་ཆུད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དང་འཚམ་པའི་ཆོས་བསྟན་ཏོ། །
en: Realizing this, he taught her the Dharma particularly suited to her,

source: དེ་ནས་དེས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་མཆིད་ཀྱི་མཇུག་རྫོགས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: and when she had understood all that the Blessed One had said, she took leave of him.

source: དེ་སོང་ནས་རིང་པོར་མ་ལོན་པར་འབྱུང་བ་ཆེན་པོ་མ་སྙོམས་པར་གྱུར་ནས་
en: Not long after she had gone, her bodily elements fell into disequilibrium.

source: དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བཞིན་དུ་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནས་ལྷ་ཡུལ་དུ་སྐྱེས་སོ། །
en: She died with a mind filled with joy toward the Blessed One, transmigrated, and passed on to rebirth in the realm of the gods.

source: ལྷའི་བུའམ་ལྷའི་བུ་མོ་སྐྱེས་མ་ཐག་པ་ནི་ཆོས་ཉིད་ཀྱིས་སེམས་རྣམ་པ་གསུམ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Now when young gods and goddesses are born they possess three different types of innate knowledge.

source: གང་ནས་ཤི་འཕོས་གང་དུ་སྐྱེས་ལས་གང་གིས་སྐྱེས་སྙམ་མོ། །
en: They know (1) whence they have died and transmigrated, (2) where they have been born, and (3) why they have taken birth there.

source: དེ་ནས་བཅོམ་འདས་ལ་ཀོ་ཤ་ཏ་ཀའི་མེ་ཏོག་གིས་གཏོར་ཏེ་དེ་ལ་སེམས་དགའ་བར་གྱུར་པར་དེས་མཐོང་ནས་བསམས་པ།
en: When she saw that she had scattered kośataka flowers over the Blessed One and felt joy toward him in her past life, she thought, “It’s been a whole day since I approached the Blessed One and offered him my respect.

source: བདག་ཞག་ལོན་ནས་གཟོད་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འགྲོ་བ་ནི་བདག་གི་ཆ་མ་ཡིན་གྱིས་བདག་ཞག་མ་ལོན་པར་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འགྲོའོ་སྙམ་མོ། །
en: This isn’t proper of me. Not a day should pass without my seeing the Blessed One and offering him my respect.”

source: དེ་ནས་རྣ་ཆ་གདུབ་ཀོར་དག་ཅིང་འགུལ་བ་ཐོགས་པ་ལུས་དོ་ཤལ་དང་སེ་མོ་དོས་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་ཅོད་པན་ཅན་ལུས་གུར་གུམ་དང་ཏ་མ་ལའི་ལོ་མ་དང་། སྤྲྀ་ཀ་ལ་སོགས་པས་བྱུགས་པ།
en: So she decorated herself with earrings, garlands, and strings of precious stones, put on a crown decorated with various types of precious jewels, and perfumed her body with saffron, tamala, spṛka, and other herbs.

source: ཁ་དོག་འཕགས་པ་དེས་དེ་ཉིད་ཀྱི་མཚན་མོ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བ་རྣམས་ཀྱིས་ཐུ་བ་བཀང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Thus nobly attired, that night she filled the front of her long shirt with divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers, and she approached the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་དང་མན་དཱ་ར་བ་རྣམས་ཀྱིས་གཏོར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: She scattered the divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers over the Blessed One, touched her head to the Blessed One’s feet,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་ཁམས་དང་། རང་བཞིན་དང་ཤེས་པ་ཐུགས་སུ་ཆུད་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended her thoughts, habitual tendencies, temperament, capacity, and nature, and taught her the Dharma accordingly.

source: དེས་ན་ལྷ་མོ་དེས་སྟན་དེ་ཁོ་ན་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When she heard it, the goddess destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where she sat.

source: དེས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ།
en: Having seen the truths, she rose from her seat,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: touched her head to the Blessed One’s feet,

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: circumambulated the Blessed One three times,

source: དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: and disappeared on the spot.

source: དེ་ནས་དགེ་སློང་སྲོད་དང་ཐོ་རངས་མི་ཉལ་བར་བརྩོན་པ་ལྷུར་བྱེད་པ་ལ་གནས་པ་རྣམས་ཀྱིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་མཐོང་ནས་བསམས་པ།
en: When she did that, the monks committed to practicing earnestly by foregoing sleep from dusk to dawn noticed many great rays of light spreading forth from the garden of Prince Jeta and wondered,
